GopalSaraf/Practicals/PSDL/include/proc/pic18f458.inc
// Register: CVRCON
#define CVRCON CVRCON
CVRCON                                   equ 0FB5h
// bitfield definitions
CVRCON_CVR_POSN                          equ 0000h
CVRCON_CVR_POSITION                      equ 0000h
CVRCON_CVR_SIZE                          equ 0004h
CVRCON_CVR_LENGTH                        equ 0004h
CVRCON_CVR_MASK                          equ 000Fh
CVRCON_CVRSS_POSN                        equ 0004h
CVRCON_CVRSS_POSITION                    equ 0004h
CVRCON_CVRSS_SIZE                        equ 0001h
CVRCON_CVRSS_LENGTH                      equ 0001h
CVRCON_CVRSS_MASK                        equ 0010h
CVRCON_CVRR_POSN                         equ 0005h
CVRCON_CVRR_POSITION                     equ 0005h
CVRCON_CVRR_SIZE                         equ 0001h
CVRCON_CVRR_LENGTH                       equ 0001h
CVRCON_CVRR_MASK                         equ 0020h
CVRCON_CVROE_POSN                        equ 0006h
CVRCON_CVROE_POSITION                    equ 0006h
CVRCON_CVROE_SIZE                        equ 0001h
CVRCON_CVROE_LENGTH                      equ 0001h
CVRCON_CVROE_MASK                        equ 0040h
CVRCON_CVREN_POSN                        equ 0007h
CVRCON_CVREN_POSITION                    equ 0007h
CVRCON_CVREN_SIZE                        equ 0001h
CVRCON_CVREN_LENGTH                      equ 0001h
CVRCON_CVREN_MASK                        equ 0080h
CVRCON_CVR0_POSN                         equ 0000h
CVRCON_CVR0_POSITION                     equ 0000h
CVRCON_CVR0_SIZE                         equ 0001h
CVRCON_CVR0_LENGTH                       equ 0001h
CVRCON_CVR0_MASK                         equ 0001h
CVRCON_CVR1_POSN                         equ 0001h
CVRCON_CVR1_POSITION                     equ 0001h
CVRCON_CVR1_SIZE                         equ 0001h
CVRCON_CVR1_LENGTH                       equ 0001h
CVRCON_CVR1_MASK                         equ 0002h
CVRCON_CVR2_POSN                         equ 0002h
CVRCON_CVR2_POSITION                     equ 0002h
CVRCON_CVR2_SIZE                         equ 0001h
CVRCON_CVR2_LENGTH                       equ 0001h
CVRCON_CVR2_MASK                         equ 0004h
CVRCON_CVR3_POSN                         equ 0003h
CVRCON_CVR3_POSITION                     equ 0003h
CVRCON_CVR3_SIZE                         equ 0001h
CVRCON_CVR3_LENGTH                       equ 0001h
CVRCON_CVR3_MASK                         equ 0008h
CVRCON_CVROEN_POSN                       equ 0006h
CVRCON_CVROEN_POSITION                   equ 0006h
CVRCON_CVROEN_SIZE                       equ 0001h
CVRCON_CVROEN_LENGTH                     equ 0001h
CVRCON_CVROEN_MASK                       equ 0040h

// Register: ECCPAS
#define ECCPAS ECCPAS
ECCPAS                                   equ 0FB6h
// bitfield definitions
ECCPAS_PSSBD_POSN                        equ 0000h
ECCPAS_PSSBD_POSITION                    equ 0000h
ECCPAS_PSSBD_SIZE                        equ 0002h
ECCPAS_PSSBD_LENGTH                      equ 0002h
ECCPAS_PSSBD_MASK                        equ 0003h
ECCPAS_PSSAC_POSN                        equ 0002h
ECCPAS_PSSAC_POSITION                    equ 0002h
ECCPAS_PSSAC_SIZE                        equ 0002h
ECCPAS_PSSAC_LENGTH                      equ 0002h
ECCPAS_PSSAC_MASK                        equ 000Ch
ECCPAS_ECCPAS_POSN                       equ 0004h
ECCPAS_ECCPAS_POSITION                   equ 0004h
ECCPAS_ECCPAS_SIZE                       equ 0003h
ECCPAS_ECCPAS_LENGTH                     equ 0003h
ECCPAS_ECCPAS_MASK                       equ 0070h
ECCPAS_ECCPASE_POSN                      equ 0007h
ECCPAS_ECCPASE_POSITION                  equ 0007h
ECCPAS_ECCPASE_SIZE                      equ 0001h
ECCPAS_ECCPASE_LENGTH                    equ 0001h
ECCPAS_ECCPASE_MASK                      equ 0080h
ECCPAS_PSSBD0_POSN                       equ 0000h
ECCPAS_PSSBD0_POSITION                   equ 0000h
ECCPAS_PSSBD0_SIZE                       equ 0001h
ECCPAS_PSSBD0_LENGTH                     equ 0001h
ECCPAS_PSSBD0_MASK                       equ 0001h
ECCPAS_PSSBD1_POSN                       equ 0001h
ECCPAS_PSSBD1_POSITION                   equ 0001h
ECCPAS_PSSBD1_SIZE                       equ 0001h
ECCPAS_PSSBD1_LENGTH                     equ 0001h
ECCPAS_PSSBD1_MASK                       equ 0002h
ECCPAS_PSSAC0_POSN                       equ 0002h
ECCPAS_PSSAC0_POSITION                   equ 0002h
ECCPAS_PSSAC0_SIZE                       equ 0001h
ECCPAS_PSSAC0_LENGTH                     equ 0001h
ECCPAS_PSSAC0_MASK                       equ 0004h
ECCPAS_PSSAC1_POSN                       equ 0003h
ECCPAS_PSSAC1_POSITION                   equ 0003h
ECCPAS_PSSAC1_SIZE                       equ 0001h
ECCPAS_PSSAC1_LENGTH                     equ 0001h
ECCPAS_PSSAC1_MASK                       equ 0008h
ECCPAS_ECCPAS0_POSN                      equ 0004h
ECCPAS_ECCPAS0_POSITION                  equ 0004h
ECCPAS_ECCPAS0_SIZE                      equ 0001h
ECCPAS_ECCPAS0_LENGTH                    equ 0001h
ECCPAS_ECCPAS0_MASK                      equ 0010h
ECCPAS_ECCPAS1_POSN                      equ 0005h
ECCPAS_ECCPAS1_POSITION                  equ 0005h
ECCPAS_ECCPAS1_SIZE                      equ 0001h
ECCPAS_ECCPAS1_LENGTH                    equ 0001h
ECCPAS_ECCPAS1_MASK                      equ 0020h
ECCPAS_ECCPAS2_POSN                      equ 0006h
ECCPAS_ECCPAS2_POSITION                  equ 0006h
ECCPAS_ECCPAS2_SIZE                      equ 0001h
ECCPAS_ECCPAS2_LENGTH                    equ 0001h
ECCPAS_ECCPAS2_MASK                      equ 0040h

// Register: ECCP1DEL
#define ECCP1DEL ECCP1DEL
ECCP1DEL                                 equ 0FB7h
// bitfield definitions
ECCP1DEL_EPDC_POSN                       equ 0000h
ECCP1DEL_EPDC_POSITION                   equ 0000h
ECCP1DEL_EPDC_SIZE                       equ 0008h
ECCP1DEL_EPDC_LENGTH                     equ 0008h
ECCP1DEL_EPDC_MASK                       equ 00FFh
ECCP1DEL_EPDC0_POSN                      equ 0000h
ECCP1DEL_EPDC0_POSITION                  equ 0000h
ECCP1DEL_EPDC0_SIZE                      equ 0001h
ECCP1DEL_EPDC0_LENGTH                    equ 0001h
ECCP1DEL_EPDC0_MASK                      equ 0001h
ECCP1DEL_EPDC1_POSN                      equ 0001h
ECCP1DEL_EPDC1_POSITION                  equ 0001h
ECCP1DEL_EPDC1_SIZE                      equ 0001h
ECCP1DEL_EPDC1_LENGTH                    equ 0001h
ECCP1DEL_EPDC1_MASK                      equ 0002h
ECCP1DEL_EPDC2_POSN                      equ 0002h
ECCP1DEL_EPDC2_POSITION                  equ 0002h
ECCP1DEL_EPDC2_SIZE                      equ 0001h
ECCP1DEL_EPDC2_LENGTH                    equ 0001h
ECCP1DEL_EPDC2_MASK                      equ 0004h
ECCP1DEL_EPDC3_POSN                      equ 0003h
ECCP1DEL_EPDC3_POSITION                  equ 0003h
ECCP1DEL_EPDC3_SIZE                      equ 0001h
ECCP1DEL_EPDC3_LENGTH                    equ 0001h
ECCP1DEL_EPDC3_MASK                      equ 0008h
ECCP1DEL_EPDC4_POSN                      equ 0004h
ECCP1DEL_EPDC4_POSITION                  equ 0004h
ECCP1DEL_EPDC4_SIZE                      equ 0001h
ECCP1DEL_EPDC4_LENGTH                    equ 0001h
ECCP1DEL_EPDC4_MASK                      equ 0010h
ECCP1DEL_EPDC5_POSN                      equ 0005h
ECCP1DEL_EPDC5_POSITION                  equ 0005h
ECCP1DEL_EPDC5_SIZE                      equ 0001h
ECCP1DEL_EPDC5_LENGTH                    equ 0001h
ECCP1DEL_EPDC5_MASK                      equ 0020h
ECCP1DEL_EPDC6_POSN                      equ 0006h
ECCP1DEL_EPDC6_POSITION                  equ 0006h
ECCP1DEL_EPDC6_SIZE                      equ 0001h
ECCP1DEL_EPDC6_LENGTH                    equ 0001h
ECCP1DEL_EPDC6_MASK                      equ 0040h
ECCP1DEL_EPDC7_POSN                      equ 0007h
ECCP1DEL_EPDC7_POSITION                  equ 0007h
ECCP1DEL_EPDC7_SIZE                      equ 0001h
ECCP1DEL_EPDC7_LENGTH                    equ 0001h
ECCP1DEL_EPDC7_MASK                      equ 0080h

